In [3]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('../Datasets/emp.csv')
df.head(3)

   empno  ename        job     mgr    hiredate   sal  comm  deptno
0   7839   KING  PRESIDENT     NaN  11/17/2001  5000   NaN      10
1   7698  BLAKE    MANAGER  7839.0  05/01/2001  2850   NaN      30
2   7782  CLARK    MANAGER  7839.0  06/09/2001  2450   NaN      10

#### Target Encoding

In [13]:
df2=df

In [15]:
sorted(df2['job'].unique())

['ANALYST', 'CLERK', 'MANAGER', 'PRESIDENT', 'SALESMAN']

In [19]:
df2['job'].value_counts()

job
SALESMAN     4
CLERK        4
MANAGER      3
ANALYST      2
PRESIDENT    1
Name: count, dtype: int64

In [21]:
cols_nums = {'job' : {'ANALYST': 3, 'CLERK': 5,'MANAGER': 2,'PRESIDENT': 1,'SALESMAN': 4}}

In [23]:
df2.head()

   empno   ename        job     mgr    hiredate   sal    comm  deptno
0   7839    KING  PRESIDENT     NaN  11/17/2001  5000     NaN      10
1   7698   BLAKE    MANAGER  7839.0  05/01/2001  2850     NaN      30
2   7782   CLARK    MANAGER  7839.0  06/09/2001  2450     NaN      10
3   7566   JONES    MANAGER  7839.0  04/02/2001  2975     NaN      20
4   7654  MARTIN   SALESMAN  7698.0  09/28/2001  1250  1400.0      30

In [27]:
df2 = df2.replace(cols_nums).infer_objects(copy=False)

In [31]:
df2.head()

   empno   ename  job     mgr    hiredate   sal    comm  deptno
0   7839    KING    1     NaN  11/17/2001  5000     NaN      10
1   7698   BLAKE    2  7839.0  05/01/2001  2850     NaN      30
2   7782   CLARK    2  7839.0  06/09/2001  2450     NaN      10
3   7566   JONES    2  7839.0  04/02/2001  2975     NaN      20
4   7654  MARTIN    4  7698.0  09/28/2001  1250  1400.0      30

In [33]:
def salCatg(salary): 
    if salary >= 3000:r = 1 
    elif salary >= 1500: r = 2 
    else:r=3 
    return r

In [35]:
df2['sal'] = df2['sal'].apply(salCatg) 
df2.head ()

   empno   ename  job     mgr    hiredate  sal    comm  deptno
0   7839    KING    1     NaN  11/17/2001    1     NaN      10
1   7698   BLAKE    2  7839.0  05/01/2001    2     NaN      30
2   7782   CLARK    2  7839.0  06/09/2001    2     NaN      10
3   7566   JONES    2  7839.0  04/02/2001    2     NaN      20
4   7654  MARTIN    4  7698.0  09/28/2001    3  1400.0      30